# Ejercicios

<div style="border-left: 5px solid #f0ad4e; padding:1.25rem; border-right: 1px solid #eee;  border-top: 1px solid #eee;  border-bottom: 1px solid #eee;">

<h5 id="ensure-correct-role-and-provide-a-label">Nota Aclaratoria</h5>

<p>Antes de cada consulta tenemos que colocar  <b>%%sql</b>, la herramienta de comandos magicos de SQL</p>

</div>

In [1]:
%load_ext sql
%sql sqlite://

In [2]:
%%sql
CREATE TABLE clientes (
  id INTEGER PRIMARY KEY,
  nombre TEXT,
  pais TEXT
);

INSERT INTO clientes (id, nombre, pais) VALUES
  (1, 'Juan', 'España'),
  (2, 'Maria', 'España'),
  (3, 'Pedro', 'México'),
  (4, 'Ana', 'Estados Unidos'),
  (5, 'Carlos', 'España');

CREATE TABLE pedidos (
  id INTEGER PRIMARY KEY,
  id_cliente INTEGER,
  monto REAL,
  FOREIGN KEY (id_cliente) REFERENCES clientes (id)
);

INSERT INTO pedidos (id, id_cliente, monto) VALUES
  (1, 1, 100),
  (2, 2, 50),
  (3, 3, 75),
  (4, 4, 200),
  (5, 1, 25),
  (6, 5, 125);

 * sqlite://
Done.
5 rows affected.
Done.
6 rows affected.

[]

A continuación encontraras cinco ejercicios en qle utilizando la tablas **"clientes y pedidos"** utilizando las funciones **IN**

<hr style="height:5px; width: 100%; border-radius: 20%; background-color:#E7046B ; border-color: #E7046B">

# Ejercicio 1

Selecciona el nombre y país de todos los clientes que hayan realizado al menos un pedido:

<div style="border-left: 5px solid #04E720; padding:1.25rem; border-right: 1px solid #eee;  border-top: 1px solid #eee;  border-bottom: 1px solid #eee;"><h5 id="ensure-correct-role-and-provide-a-label">Pista: </h5>

Recuerda anidar la sentencia SELECT dentro de la setencia WHERE
</div>

```sql
IN (SELECT id_cliente FROM pedidos);

```

In [3]:
%%sql
SELECT nombre, pais FROM clientes WHERE id IN (SELECT id_cliente FROM pedidos);

 * sqlite://
Done.

[('Juan', 'España'),
 ('Maria', 'España'),
 ('Pedro', 'México'),
 ('Ana', 'Estados Unidos'),
 ('Carlos', 'España')]

# Ejercicio 2


Selecciona el nombre de todos los clientes que no hayan realizado ningún pedido:

<div style="border-left: 5px solid #04E720; padding:1.25rem; border-right: 1px solid #eee;  border-top: 1px solid #eee;  border-bottom: 1px solid #eee;"><h5 id="ensure-correct-role-and-provide-a-label">Pista: </h5>

-No todos los resultados deben proveer datos, aveces los resultdos de las consultas es que no existen, igual debes probarlo haciendo la consulta.
</div>

```sql
WHERE id NOT IN 
```

In [4]:
%%sql
SELECT nombre FROM clientes WHERE id NOT IN (SELECT id_cliente FROM pedidos);

 * sqlite://
Done.

[]

# Ejercicio 3


Selecciona el monto de todos los pedidos realizados por clientes que tengan un nombre que empiece con la letra 'M':

<div style="border-left: 5px solid #04E720; padding:1.25rem; border-right: 1px solid #eee;  border-top: 1px solid #eee;  border-bottom: 1px solid #eee;"><h5 id="ensure-correct-role-and-provide-a-label">Pista: </h5>

1. Utiliza como ejemplo el comando LIKE que proporcionaremos abajo para consultar todos los hombres que empiecen por M
</div>

```sql
WHERE nombre LIKE 'M%';


```

In [9]:
%%sql
SELECT monto FROM pedidos
WHERE id_cliente IN (SELECT id FROM clientes WHERE nombre LIKE 'M%');

 * sqlite://
Done.

[(50.0,)]

# Ejercicio 4


Selecciona el monto de todos los pedidos realizados por clientes que tengan un nombre que empiece con la letra 'M':

Selecciona el monto de todos los pedidos realizados por clientes que tengan un nombre de al menos 5 caracteres. Utiliza la tabla pedidos y la tabla clientes, pero no utilices la columna nombre de la tabla clientes.

Solución:

<div style="border-left: 5px solid #04E720; padding:1.25rem; border-right: 1px solid #eee;  border-top: 1px solid #eee;  border-bottom: 1px solid #eee;"><h5 id="ensure-correct-role-and-provide-a-label">Pista: </h5>

1. Utiliza como ejemplo el comando LIKE que proporcionaremos abajo para consultar todos los hombres que empiecen por M
</div>

```sql
WHERE LENGTH(pais) >= 5


```

In [12]:
%%sql
SELECT monto FROM pedidos
WHERE id_cliente IN (SELECT id FROM clientes WHERE LENGTH(pais) >= 5);

 * sqlite://
Done.

[(100.0,), (50.0,), (75.0,), (200.0,), (25.0,), (125.0,)]

<hr style="height:5px; width: 100%; border-radius: 20%; background-color:#E7046B ; border-color: #E7046B">